{"status":"success","totalResults":4091,"results":[{"title":"'The White Lotus' Creator Mike White Sees His Show Going Down – Down Under, That Is","link":"https://deadline.com/2023/06/white-lotus-creator-mike-white-sees-his-show-going-down-under-1235413609/","keywords":["Breaking News","Development","Marketing","Australia","Jennifer Coolidge","Mike White","The White Lotus"],"creator":["Bruce Haring"],"video_url":null,"description":"Next stop for HBO’s “The White Lotus” series could be Australia, creator Mike White said Since it premiered in 2021, the show has moved around the globe. Season one was set in Hawaii, the second in Italy’s Sicily, and the third leg is now is being produced in Thailand. White made his remarks while taking […]","content":"Next stop for HBO’s “ The White Lotus ” series could be Australia , creator Mike White said Since it premiered in 2021, the show has moved around the globe. Season one was set in Hawaii, the second in Italy’s Sicily, and the third leg is now is being produced in Thailand. White made his remarks while taking part in a Sydney, Australia, festival with the show’s star, Jennifer Coolidge . He spoke about filming a potential season Down Under during a press conference on Saturday morning. Related Story Rebel Wilson Makes A Splash In Cannes Announcing Her Feature Film Directing Debut 'The Deb' Will Shoot Down Under In September “My dream would be to hit every continent, so yeah, this is like its own continent, basically,” he said. “We kind of have to come to Australia if we keep going. “It would be so fun. Obviously, there’s a huge wealth of talent here and the beauty is inarguable, so it feels like it checks all the boxes.” Also discussed: a possible prequel series centred around Coolidge’s character, Tanya McQuoid. “I absolutely think that’s possible, we were just talking about that,” White said. “It’s a funny idea. And making Jennifer, you know, 20 years younger, that would be fun too. I think Jennifer’s like, ‘Sure, let’s do it!’.” When asked where she would want the series to take place, Coolidge said, “Australia gets my vote.”","pubDate":"2023-06-10 16:35:45","image_url":"https://deadline.com/wp-content/uploads/2022/09/MAB_9101-e1686414152985.jpg","source_id":"deadline","category":["business"],"country":["united states of america"],"language":"english"},{"title":"Crypto.com Arena Will Retain Its Name Despite Corporate Shuffling","link":"https://deadline.com/2023/06/crypto-com-arena-will-retain-name-despite-corporate-shuffling-1235413579/","keywords":["Breaking News","Controversial","Corporate Affairs","Sports","Crypto.com Arena","Los Angeles Clippers","Los Angeles Kings","Los Angeles Lakers","Los Angeles Sparks"],"creator":["Bruce Haring"],"video_url":null,"description":"Crypto.com is shuttng down a portion of its business, but its name will remain on the downtown Los Angeles arena that is home to the Lakers, Clippers, Kings and Sparks. On Friday, Crypto.com said it is closing its institutional exchange in the US. That division helped large investors trade in and out of positions in […]","content":"Crypto.com is shuttng down a portion of its business, but its name will remain on the downtown Los Angeles arena that is home to the Lakers, Clippers, Kings and Sparks. On Friday, Crypto.com said it is closing its institutional exchange in the US. That division helped large investors trade in and out of positions in cryptocurrency. About 400 customers are affected, the company said. However, the company’s biggest service, its app, will continue on to serve small investors. The app has multiple millions of users, the company claims. Crypto.com purchased the naming rights to the arena from Anschutz Entertainment Group (AEG) in 2021. Crypto.com paid $700 million to have its name on the venue for 20 years. The arena was previously known as Staples Center. Stadium and arena names change frequently in sports as corporate fortunes wax and wane. The NBA recently saw the Miami Heat’s FTX Arena sell its naming rights to a software company after FTX went bankrupt in a massive scandal.","pubDate":"2023-06-10 15:33:49","image_url":"https://deadline.com/wp-content/uploads/2023/06/AP23147095083990.jpg","source_id":"deadline","category":["business"],"country":["united states of america"],"language":"english"},{"title":"Harley-Davidson X440 Shown In New Images","link":"https://www.carandbike.com/news/harleydavidson-x440-shown-in-new-images-3207591","keywords":null,"creator":null,"video_url":null,"description":"The X440 is the first motorcycle from the brand that has been developed in collaboration with Hero MotoCorp","content":"has released some new photos of its upcoming motorcycle, the X440. The motorcycle, which has been teased by the manufacturer a couple of times now, has been designed and developed in collaboration with and will be the first among a series of two-wheelers to come from this partnership. The X440 will see a launch on July 3. Also Read: The new photos show the production spec X440 on road for the first time and gives the viewer a clearer look. In terms of design, the motorcycle looks fresh and appealing, partly being inspired by Harley's XR1200. It gets a circular-shaped LED headlamp, mirrors and indicators and instrument pod which will most likely be fully digital and feature Bluetooth connectivity. Coming to the cycle parts, the X440 gets upside down fork up front and dual shock absorbers at the rear, which is adjustable for pre-load. It features 18-inch wheel up front and a 17-inch unit at the rear, shod with MRF tyres. We also expect it to be equipped with dual-channel ABS as standard upon launch. The power unit on the motorcycle will be a 440 cc single-cylinder unit, which is oil-cooled and employs a chain drive. The engine will likely be mated to a a 6-speed gearbox. Harley-Davidson hasn’t revealed any details on power and torque output yet and this information will only be revealed close to the launch. Also Read: The motorcycle has largely been viewed as a potential rival to ’s and ’s 350 cc line up. Hence, it is expected to be priced between Rs 2.5 lakh and Rs 3 lakh. This makes it the most affordable Harley-Davidson to be sold in India.","pubDate":"2023-06-10 15:04:40","image_url":"https://images.carandbike.com/cms/articles/2023/6/3207591/Harley_Davidson_X440_Shown_In_New_Images_16f1088686.jpg","source_id":"carandbike","category":["business"],"country":["india"],"language":"english"},{"title":"Deal Dive: Finally, a startup building a network for those who could benefit the most","link":"https://techcrunch.com/2023/06/10/deal-dive-2045-community-startups/","keywords":["Startups","Venture","2045","diversity and inclusion","EC DEI","EC venture capital","Jopwell","professional network","venture capital"],"creator":["Rebecca Szkutak"],"video_url":null,"description":"Network-focused startups have started getting a bad rep in startup land, but 2045 is actually bringing something new to the table. Deal Dive: Finally, a startup building a network for those who could benefit the most by Rebecca Szkutak originally published on TechCrunch","content":"The tech industry has tried hard to address its diversity problem, but hiring talent from different backgrounds is only the first “challenge.” A bigger one is retaining them. Porter Braswell is no stranger to the statistics or to companies’ various excuses for why the numbers are so bad. Early in his career, he struggled to break into tech despite holding internships at Morgan Stanley and Goldman Sachs, and was repeatedly told it was a pipeline problem. So, Braswell launched Jopwell, a career platform for people from underrepresented communities and backgrounds. Nearly a decade later, the company says it has supported tens of thousands of professionals, and Braswell has moved into an executive chairman role, looking for his next problem to solve. It wasn’t far off: He found that while many companies had started hiring more people of color, they had a new issue in getting the employees to stay. “Retention is a major challenge and still remains so,” Braswell told TechCrunch+. “My heart was pulling me toward the retention part of the equation, especially [the feeling of] belonging. What are the variables that lead people to feel like they belong or that ultimately lead individuals of color to leave organizations? It’s because they don’t feel seen, heard or valued.” Braswell decided the best solution was to create a community that could help people feel valued and also involve the corporations they work for. That came in the form of 2045, named for the year when communities of color are expected to become the majority in the U.S. The company recently raised a $4.2 million pre-seed round led by Ken Chenault Jr., the former CEO of Amex. “It was astonishing to me that no one was building a community for what will be the largest population in America,” he said. 2045 is launching at an interesting time for community startups.","pubDate":"2023-06-10 15:00:20","image_url":null,"source_id":"techcrunch","category":["business"],"country":["united states of america"],"language":"english"},{"title":"Govt may cut petrol, diesel prices after reviewing OMCs’ performance in Q1 FY24","link":"https://www.thehindubusinessline.com/economy/govt-may-cut-petrol-diesel-prices-after-reviewing-omcs-performance-in-q1-fy24/article66954258.ece","keywords":null,"creator":null,"video_url":null,"description":"The OMCs have been making losses on sale of petrol and diesel to the public due to unprecedented volatility in international crude oil prices","content":"By Rishi Ranjan Kala Comments READ LATER The common man can expect a cut in petrol and diesel prices during the July-September or the October-December quarter in FY24 as softening international crude oil prices are aiding oil marketing companies (OMCs) in recouping losses incurred during FY23. The Government is expected to take a decision on reducing retail prices of the two key auto fuels after reviewing earnings of the PSU OMCs in the April-June quarter in FY24. Oil Minister HS Puri on Saturday said, “If you are asking my expectation on prices (petrol and diesel), I want them to come down if international crude prices remain stable and do not rise. In last quarter (Q4 FY23), our OMCs did okay, meaning they did not incur losses. I am not in a position to make an announcement, but I think if next quarter (Q1 FY24) goes well and the coming time is fine, they will be in a position to look at it (cutting prices).” When prodded further, the Minister said, “Prices are determined in terms of some serious decision making. OMCs have recovered some of their losses. As we go along, we will see what can be done.” The OMCs have been making losses on sale of petrol and diesel to the public due to unprecedented volatility in international crude oil prices following the Ukraine war in February 2022 and a freeze on the retail prices since April 6, 2022. However, the government cumulatively cut the excise duty by ₹13 per litre and ₹16 on petrol and diesel, respectively, during November 2021 and May 2022, to tame inflation. Petrol costs ₹96.72 a litre in Delhi, while diesel is priced at ₹89.62. The Indian Oil Corporation (IOCL) , Bharat Petroleum Corporation (BPCL) and Hindustan Petroleum Corporation (HPCL) cumulatively posted a loss of ₹18,622 crore during April-December of FY23. Puri commended the OMCs for acting as “responsible corporate citizens” by shielding the common man from high prices of auto fuels. For instance, while crude oil prices (Indian basket) in rupee per barrel terms rose by 23 per cent between December 2021 and March 2023, the increase in Retail Selling Price (RSP) of Petrol and Diesel at Delhi has only been 1.08 per cent and 3.40 per cent, respectively. The timing of the expected cut in the oil prices coincides neatly with the crucial upcoming Assembly elections in Madhya Pradesh, Rajasthan and Chhattisgarh where the ruling BJP is directly pitted against the Congress. Elections are also scheduled in Telangana where the BJP has been trying to make a mark. Comments","pubDate":"2023-06-10 13:07:18","image_url":null,"source_id":"thehindubusinessline","category":["business"],"country":["india"],"language":"english"},{"title":"Govt may cut petrol, diesel prices after reviewing OMCs’ performance in Q1 FY24","link":"https://www.thehindubusinessline.com/companies/govt-may-cut-petrol-diesel-prices-after-reviewing-omcs-performance-in-q1-fy24/article66954258.ece","keywords":null,"creator":null,"video_url":null,"description":"The OMCs have been making losses on sale of petrol and diesel to the public due to unprecedented volatility in international crude oil prices","content":"By Rishi Ranjan Kala Comments READ LATER The common man can expect a cut in petrol and diesel prices during the July-September or the October-December quarter in FY24 as softening international crude oil prices are aiding oil marketing companies (OMCs) in recouping losses incurred during FY23. The Government is expected to take a decision on reducing retail prices of the two key auto fuels after reviewing earnings of the PSU OMCs in the April-June quarter in FY24. Oil Minister HS Puri on Saturday said, “If you are asking my expectation on prices (petrol and diesel), I want them to come down if international crude prices remain stable and do not rise. In last quarter (Q4 FY23), our OMCs did okay, meaning they did not incur losses. I am not in a position to make an announcement, but I think if next quarter (Q1 FY24) goes well and the coming time is fine, they will be in a position to look at it (cutting prices).” When prodded further, the Minister said, “Prices are determined in terms of some serious decision making. OMCs have recovered some of their losses. As we go along, we will see what can be done.” The OMCs have been making losses on sale of petrol and diesel to the public due to unprecedented volatility in international crude oil prices following the Ukraine war in February 2022 and a freeze on the retail prices since April 6, 2022. However, the government cumulatively cut the excise duty by ₹13 per litre and ₹16 on petrol and diesel, respectively, during November 2021 and May 2022, to tame inflation. Petrol costs ₹96.72 a litre in Delhi, while diesel is priced at ₹89.62. The Indian Oil Corporation (IOCL) , Bharat Petroleum Corporation (BPCL) and Hindustan Petroleum Corporation (HPCL) cumulatively posted a loss of ₹18,622 crore during April-December of FY23. Puri commended the OMCs for acting as “responsible corporate citizens” by shielding the common man from high prices of auto fuels. For instance, while crude oil prices (Indian basket) in rupee per barrel terms rose by 23 per cent between December 2021 and March 2023, the increase in Retail Selling Price (RSP) of Petrol and Diesel at Delhi has only been 1.08 per cent and 3.40 per cent, respectively. The timing of the expected cut in the oil prices coincides neatly with the crucial upcoming Assembly elections in Madhya Pradesh, Rajasthan and Chhattisgarh where the ruling BJP is directly pitted against the Congress. Elections are also scheduled in Telangana where the BJP has been trying to make a mark. Comments","pubDate":"2023-06-10 13:07:18","image_url":null,"source_id":"thehindubusinessline","category":["business"],"country":["india"],"language":"english"},{"title":"Mull: Dream jobs on offer for two with year-long stay included","link":"https://www.heraldscotland.com/business_hq/23581005.mull-dream-jobs-offer-two-year-long-stay-included/?ref=rss","keywords":null,"creator":null,"video_url":null,"description":"Two dream jobs on one of Scotland’s most picturesque islands are being offered to people who won’t crumble under pressure.","content":"Two dream jobs on one of Scotland’s most picturesque islands are being offered to people who won’t crumble under pressure. The full-time roles – with accommodation – provide training all aspects of biscuit-making at an organic baker on Mull. The winning candidates will get a year’s stay on the island, a salary of around £19,000-£22,000 and hands-on experience in everything from baking to chocolate work and packing. No previous biscuit-making experience is required, and there may be further opportunities once the year is up. The roles are being offered by Island Bakery Organics, based in the island’s main town of Tobermory, and are said to be suitable for a couple or two close friends keen to embrace island life. The jobs really take the biscuit Island Bakery Organics products are stocked in Waitrose and organic and deli stores across the UK, Europe, and the USA, Their range includes oatcakes, shortbreads, and sweet treats such as Lemon Melts and Chocolate Gingers. Joe Reade, Director, Island Bakery Organics, said: \"These positions are ideally suited for a couple or good friends, perhaps starting out in their careers in Scotland's rich and diverse food industry. “We're a close-knit team, employing a number of local residents, but see this as an exciting opportunity to welcome some new faces and give them a real taste of island life.\" Mull, in Argylle, is one of Scotland;s most popular tourist islands for tourists. Criss-crossed with single-track roads, it boasts rugged scenery, white sand beaches, ancient standing stones and golden eagles. The island boasts stunning scenery Tobermory is famous for the brightly-painted houses along its main street, and stood in for the fictional town of Balamory in the hit children’s TV series. The jobs are advertised on the HiJOBS website - which has details and to apply for the Island Bakery Organics roles. Laura Saunders, Commercial Director and Founder, HiJOBS, said: \"This is one of the sweetest jobs HiJOBS has ever promoted. It's rare for a full-time, year-round role that includes accommodation to come up in remote locations such as the Hebrides, which is a real barrier in attracting new talent to the region.\" \"HiJOBS prides itself on supporting rural Scottish communities, and Island Bakery is the ideal example of a local and successful family-run business with the community at its heart.\"","pubDate":"2023-06-10 13:02:34","image_url":"https://www.heraldscotland.com/resources/images/16874377/?type=app&htype=0","source_id":"heraldscotland","category":["business"],"country":["united kingdom"],"language":"english"},{"title":"This week in foodtech: Cultivated meat is still a sizzling topic","link":"https://techcrunch.com/2023/06/10/foodtech-cultivated-meat-coffee-nutrition/","keywords":["Startups","Venture","Ahara","foodtech","Green Coffee Company","Higher Steaks"],"creator":["Christine Hall"],"video_url":null,"description":"If you’re adventurous with your food, or just like to keep up with the fast-moving foodtech industry, here’s a roundup of this week’s stories and some notable news we weren’t able to cover. This week in foodtech: Cultivated meat is still a sizzling topic by Christine Hall originally published on TechCrunch","content":"If you’re adventurous with your food, or just like to keep up with the fast-moving foodtech industry, here’s a roundup of this week’s stories and some notable news we weren’t able to cover. Some big news came from across the pond where the U.K.-based cultivated meat startup Higher Steaks raised $30 million and changed its name to Uncommon . Balderton Capital and Lowercarbon Capital co-led the round. The cultivated meat segment of the alternative protein industry is one of those that often has highlights and lowlights . Perhaps it’s because they hold out hope that the United States government will catch up to the forward-thinking Singapore where these products are being served. The U.K. has already made some financial commitments even as Italy’s government puts forth a bill that would ban cultivated meat . As mentioned in the story, “being able to produce large enough quantities of cultured meat at a low enough price is problematic.” Some companies, like Dutch foodtech company Meatable, said in May that its technology reached a milestone: creating cultivated pork products in eight days . Whatever happens, it’s clear from this round that some venture capitalists remain bullish about investing into this space. On Monday, look for a special TechCrunch+ investor survey on alternative proteins. Cultured meat startup Higher Steaks nabs $30M and rebrands as Uncommon Speaking of a food segment where funding continues to brew, this week the Green Coffee Company closed on $25 million in Series C equity funding . The company touts itself as “Colombia’s largest coffee producer,” and is the latest to get some funding amid coffee companies, including Chamberlain Coffee Fellow and Blank Street . Green Coffee Company’s operations span 9,000 acres across 39 farms. It also has over 11.5 million coffee trees under ownership. Its funding was a bit unique: raising capital from a network of over 450 individual, high-net-worth investors that invest directly into portfolio companies that investment firm Legacy Group advises rather than into a pooled fund, company founder Cole Shephard told TechCrunch. In total, investors have injected over $60 million into the business. Shephard noted that the company raises in this manner because “the team at Legacy has always felt strongly about offering unique and exciting deals that provide individual investors the ability to directly invest in companies that they like rather than into a blind or diversified fund model over which they have little control or in which they hand over decision-making to large funds and institutions who provide little personalized attention.” Green Coffee Co. percolates on $25M to expand in Colombia, launch alcoholic beverages Meanwhile, we’re always trying to eat healthier, and as reported this week, Ahara is a new personalized nutrition company that “provides recommendations to its customers after they first fill out a health questionnaire that asks them about their diet and health history, and their age and location, after which they can take a variety of at-home tests for genetic, epigenetic and biomarkers.” At the helm are Julie Wainwright, founder and former CEO of luxury online consignment company The RealReal, and celebrity physician-nutritionist Melina Jampolis. It’s currently in beta and reportedly will have both a freemium model and premium membership that will include special benefits. Ahara joins a crowded nutrition startup arena. As noted in the story, most offer different things, but are increasingly pushing personalization. Venture capitalists like them, too. Within the past few years, we’ve seen daily health program Mighty Health raise $7.6 million, telehealth nutrition platform Nourish raise $8 million and British nutrition and health tracking app Zoe , bring in £25 million. Julie Wainwright is back with a new, venture-backed startup I’ve not previously covered the lawsuit between Impossible Foods and Motif Foodworks that began in 2022, but in the past few weeks, the case got a bit interesting . At the end of May, some disclosures came to light that Motif suspected Impossible hired some private investigators who allegedly used fake identities to get information on Motif products. This week, a court ruled that this strategy by Impossible did not break any rules, according to a report . Here’s a brief background: Impossible sued Motif related to Motif’s use of heme proteins in making its plant-based meat alternative. Learn more about Motif’s process . Impossible alleges that Motif is infringing on its patent that covers the use of heme in making such food items. Motif says that its heme use is not the same as Impossible’s and has previously stated that, “If Impossible wins​ ​[its lawsuit in Delaware], it means no one else can experiment with heme in the plant-based industry.”​​ Mushroom mania : Quorn Foods and Prime Roots partner to expand mycelium meat category and Meat from mycelium: MyForest Foods raises $15m Series A-2, hires new CEO, teases new product . Beef, it’s what’s for dinner : Volta Greentech and Protos launch next phase of climate-friendly beef project in Sweden . Celebrity endorsements : MLB legend Derek Jeter joins Rachael Ray, David Chang as investors in Meati Foods and Marcus Samuelsson partners with cultivated meat maker Aleph Farms . If you have a juicy tip or lead about happenings in the venture and food tech worlds, you can reach Christine Hall at chall.techcrunch@gmail.com or Signal at 832-862-1051. Anonymity requests will be respected. The cultivated meat industry’s known struggles will take time to sort out, and maybe that’s OK","pubDate":"2023-06-10 13:02:26","image_url":null,"source_id":"techcrunch","category":["business"],"country":["united states of america"],"language":"english"},{"title":"Tiger Brands' delay in closing Langeberg & Ashton factory gives farmers hope","link":"https://ewn.co.za/2023/06/10/tiger-brands-delay-in-closing-langeberg-and-ashton-factory-gives-farmers-hope","keywords":null,"creator":null,"video_url":null,"description":"Canning Fruit Producers' Association chairperson Jacques Jordaan told Eyewitness News the decision to delay the closures for one more season has lifted the spirits of farmers and farmworkers.","content":"Tiger Brands' delay in closing Langeberg & Ashton factory gives farmers hope Canning Fruit Producers' Association chairperson Jacques Jordaan told Eyewitness News the decision to delay the closures for one more season has lifted the spirits of farmers and farmworkers. Picture: Supplied. Tiger Brands Food canning industry Email Print Tweet Share Carlo Petersen | 10 June 2023 13:44 CAPE TOWN - Canned fruit farmers are still hopeful that things will go in their favour after Tiger Brands decided to delay the closure of its Langeberg and Ashton factory for one more year. Tiger Brands decided to turn its back on the fruit business two years ago, leaving the industry in despair. Canning Fruit Producers Association chairperson Jacques Jordaan told Eyewitness News the decision to delay the closures for one more season has lifted the spirits of farmers and farmworkers. READ MORE: - Cosatu unhappy with Tiger Brands' decision to close Ashton canning business - Ashton fruit canning factory workers pray for investors to prevent its closure \"From our side, I think we are relieved that there is another season. That Tiger is willing to continue with the business and we don't have the distressful situation of one year ago. I think that we are happy that there is interest in the business and if there's interest, I think there's hope.\" Jordaan said the canned fruit farming business should soon be in a better position because the markets are doing well internationally. \"With the weaker rand, we really have some tailwinds in this aspect, so I think in general canning fruit exports should be in a better position with the weaker rand.\" However, Jordaan said there are still feelings of uncertainty among farmers and farm workers.","pubDate":"2023-06-10 12:23:03","image_url":null,"source_id":"ewn","category":["business"],"country":["south africa"],"language":"english"},{"title":"3 Times a Delayed Social Security Claim Won't Pay Off for You","link":"https://www.fool.com/retirement/2023/06/10/3-times-a-delayed-social-security-claim-wont-pay-o/?source=iedfolrf0000001","keywords":null,"creator":["newsfeedback@fool.com (Christy Bieber)"],"video_url":null,"description":"Delaying Social Security can sometimes be a smart decision, but there are times when this financial choice could backfire.","content":"A delayed Social Security claim can have a big payoff. You can start getting retirement checks at 62. But if you put off your claim until at least full retirement age , you avoid getting hit with up to a 30% reduction in your standard benefit that comes from monthly early filing penalties. And if you wait beyond FRA until 70, you earn monthly delayed benefits that add up to an annual 8% benefit increase. While waiting until 70 to maximize monthly benefits makes sense for a lot of people, it's not the right choice for everyone. In fact, there are three situations when putting off filing for Social Security could really backfire. Here's what they are. Image source: Getty Images. 1. If you drain your savings account Many people can't wait until 70 to retire, so they end up having to rely solely on their retirement investment accounts for support if they don't claim Social Security . The problem is, if you take too much money out of your accounts, you won't leave enough invested and your balance will fall too fast. While it may seem like a smart idea to spend your savings in order to put off claiming Social Security so you can get bigger checks later, this is actually a terrible plan. Your retirement benefits are only designed to replace 40% of pre-retirement income and you can't live on them alone -- even if you do get the maximum benefit by waiting until 70. If there's any chance a delayed Social Security claim will cause you to drain your savings dry, do not put off filing for benefits. Start your retirement checks coming so you can maintain a safe withdrawal rate ( usually around 4% of your balance or less) and continue to have multiple income sources throughout your retirement. 2. If you die before you start getting benefits or break even for missed benefits When you wait to claim Social Security, you gamble on the fact that you'll be around to get big checks later. In fact, since you're missing out on years of Social Security checks if you put off your benefits claim, you're gambling on living long enough to make up for all that forgone income with the higher payments you'll eventually receive. The sad reality is, there's a real chance you may not live long enough to get many checks if you wait until 70 to claim them. In fact, you could die before you get a single payment. Now, if you were the higher earner and you put off starting retirement benefits, this could help out your spouse since you would raise the survivor benefits they receive. But, if that doesn't apply to you, a delayed claim could backfire big time if you pass away before you break even for missed benefits. 3. If your delay causes a higher-earning spouse to claim sooner Finally, there's another situation when you might regret filing for Social Security. If you put off your Social Security check and your spouse starts theirs to bring in income for your household, this could be a huge mistake if your spouse made more than you did. See, benefits are based on average earnings. So, if your spouse made more over their career, they'd have a bigger benefit. That means they'd get a bigger payoff for delaying their benefits since the increase earned by delaying is calculated based on a percentage of the standard benefit. If you and your spouse are trying to decide who should claim benefits first, it almost always makes sense for the lower earner to start retirement checks and the person who made more to wait. This can maximize combined Social Security coming into the household once the higher earner's bigger benefit is claimed -- and it can result in larger survivor benefits too. So, before you assume a delayed claim is always the right choice, be aware that there are circumstances where it could backfire. If you think any of these could apply to you, filing for benefits ASAP may be your best option.","pubDate":"2023-06-10 12:15:00","image_url":null,"source_id":"fool","category":["business"],"country":["canada"],"language":"english"}],"nextPage":"1686399300afac7f1cfed86a6d48eadb1d14b363b5"}