{
  "status": "success",
  "totalResults": 4091,
  "results": [
    {
      "title": "'The White Lotus' Creator Mike White Sees His Show Going Down – Down Under, That Is",
      "link": "https://deadline.com/2023/06/white-lotus-creator-mike-white-sees-his-show-going-down-under-1235413609/",
      "keywords": [
        "Breaking News",
        "Development",
        "Marketing",
        "Australia",
        "Jennifer Coolidge",
        "Mike White",
        "The White Lotus"
      ],
      "creator": [
        "Bruce Haring"
      ],
      "video_url": null,
      "description": "Next stop for HBO’s “The White Lotus” series could be Australia, creator Mike White said Since it premiered in 2021, the show has moved around the globe. Season one was set in Hawaii, the second in Italy’s Sicily, and the third leg is now is being produced in Thailand. White made his remarks while taking […]",
      "content": "Next stop for HBO’s “ The White Lotus ” series could be Australia , creator Mike White said Since it premiered in 2021, the show has moved around the globe. Season one was set in Hawaii, the second in Italy’s Sicily, and the third leg is now is being produced in Thailand. White made his remarks while taking part in a Sydney, Australia, festival with the show’s star, Jennifer Coolidge . He spoke about filming a potential season Down Under during a press conference on Saturday morning. Related Story Rebel Wilson Makes A Splash In Cannes Announcing Her Feature Film Directing Debut 'The Deb' Will Shoot Down Under In September “My dream would be to hit every continent, so yeah, this is like its own continent, basically,” he said. “We kind of have to come to Australia if we keep going. “It would be so fun. Obviously, there’s a huge wealth of talent here and the beauty is inarguable, so it feels like it checks all the boxes.” Also discussed: a possible prequel series centred around Coolidge’s character, Tanya McQuoid. “I absolutely think that’s possible, we were just talking about that,” White said. “It’s a funny idea. And making Jennifer, you know, 20 years younger, that would be fun too. I think Jennifer’s like, ‘Sure, let’s do it!’.” When asked where she would want the series to take place, Coolidge said, “Australia gets my vote.”",
      "pubDate": "2023-06-10 16:35:45",
      "image_url": "https://deadline.com/wp-content/uploads/2022/09/MAB_9101-e1686414152985.jpg",
      "source_id": "deadline",
      "category": [
        "business"
      ],
      "country": [
        "united states of america"
      ],
      "language": "english"
    },
    {
      "title": "Crypto.com Arena Will Retain Its Name Despite Corporate Shuffling",
      "link": "https://deadline.com/2023/06/crypto-com-arena-will-retain-name-despite-corporate-shuffling-1235413579/",
      "keywords": [
        "Breaking News",
        "Controversial",
        "Corporate Affairs",
        "Sports",
        "Crypto.com Arena",
        "Los Angeles Clippers",
        "Los Angeles Kings",
        "Los Angeles Lakers",
        "Los Angeles Sparks"
      ],
      "creator": [
        "Bruce Haring"
      ],
      "video_url": null,
      "description": "Crypto.com is shuttng down a portion of its business, but its name will remain on the downtown Los Angeles arena that is home to the Lakers, Clippers, Kings and Sparks. On Friday, Crypto.com said it is closing its institutional exchange in the US. That division helped large investors trade in and out of positions in […]",
      "content": "Crypto.com is shuttng down a portion of its business, but its name will remain on the downtown Los Angeles arena that is home to the Lakers, Clippers, Kings and Sparks. On Friday, Crypto.com said it is closing its institutional exchange in the US. That division helped large investors trade in and out of positions in cryptocurrency. About 400 customers are affected, the company said. However, the company’s biggest service, its app, will continue on to serve small investors. The app has multiple millions of users, the company claims. Crypto.com purchased the naming rights to the arena from Anschutz Entertainment Group (AEG) in 2021. Crypto.com paid $700 million to have its name on the venue for 20 years. The arena was previously known as Staples Center. Stadium and arena names change frequently in sports as corporate fortunes wax and wane. The NBA recently saw the Miami Heat’s FTX Arena sell its naming rights to a software company after FTX went bankrupt in a massive scandal.",
      "pubDate": "2023-06-10 15:33:49",
      "image_url": "https://deadline.com/wp-content/uploads/2023/06/AP23147095083990.jpg",
      "source_id": "deadline",
      "category": [
        "business"
      ],
      "country": [
        "united states of america"
      ],
      "language": "english"
    },
    {
      "title": "Harley-Davidson X440 Shown In New Images",
      "link": "https://www.carandbike.com/news/harleydavidson-x440-shown-in-new-images-3207591",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "The X440 is the first motorcycle from the brand that has been developed in collaboration with Hero MotoCorp",
      "content": "has released some new photos of its upcoming motorcycle, the X440. The motorcycle, which has been teased by the manufacturer a couple of times now, has been designed and developed in collaboration with and will be the first among a series of two-wheelers to come from this partnership. The X440 will see a launch on July 3. Also Read: The new photos show the production spec X440 on road for the first time and gives the viewer a clearer look. In terms of design, the motorcycle looks fresh and appealing, partly being inspired by Harley's XR1200. It gets a circular-shaped LED headlamp, mirrors and indicators and instrument pod which will most likely be fully digital and feature Bluetooth connectivity. Coming to the cycle parts, the X440 gets upside down fork up front and dual shock absorbers at the rear, which is adjustable for pre-load. It features 18-inch wheel up front and a 17-inch unit at the rear, shod with MRF tyres. We also expect it to be equipped with dual-channel ABS as standard upon launch. The power unit on the motorcycle will be a 440 cc single-cylinder unit, which is oil-cooled and employs a chain drive. The engine will likely be mated to a a 6-speed gearbox. Harley-Davidson hasn’t revealed any details on power and torque output yet and this information will only be revealed close to the launch. Also Read: The motorcycle has largely been viewed as a potential rival to ’s and ’s 350 cc line up. Hence, it is expected to be priced between Rs 2.5 lakh and Rs 3 lakh. This makes it the most affordable Harley-Davidson to be sold in India.",
      "pubDate": "2023-06-10 15:04:40",
      "image_url": "https://images.carandbike.com/cms/articles/2023/6/3207591/Harley_Davidson_X440_Shown_In_New_Images_16f1088686.jpg",
      "source_id": "carandbike",
      "category": [
        "business"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Mull: Dream jobs on offer for two with year-long stay included",
      "link": "https://www.heraldscotland.com/business_hq/23581005.mull-dream-jobs-offer-two-year-long-stay-included/?ref=rss",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Two dream jobs on one of Scotland’s most picturesque islands are being offered to people who won’t crumble under pressure.",
      "content": "Two dream jobs on one of Scotland’s most picturesque islands are being offered to people who won’t crumble under pressure. The full-time roles – with accommodation – provide training all aspects of biscuit-making at an organic baker on Mull. The winning candidates will get a year’s stay on the island, a salary of around £19,000-£22,000 and hands-on experience in everything from baking to chocolate work and packing. No previous biscuit-making experience is required, and there may be further opportunities once the year is up. The roles are being offered by Island Bakery Organics, based in the island’s main town of Tobermory, and are said to be suitable for a couple or two close friends keen to embrace island life. The jobs really take the biscuit Island Bakery Organics products are stocked in Waitrose and organic and deli stores across the UK, Europe, and the USA, Their range includes oatcakes, shortbreads, and sweet treats such as Lemon Melts and Chocolate Gingers. Joe Reade, Director, Island Bakery Organics, said: \"These positions are ideally suited for a couple or good friends, perhaps starting out in their careers in Scotland's rich and diverse food industry. “We're a close-knit team, employing a number of local residents, but see this as an exciting opportunity to welcome some new faces and give them a real taste of island life.\" Mull, in Argylle, is one of Scotland;s most popular tourist islands for tourists. Criss-crossed with single-track roads, it boasts rugged scenery, white sand beaches, ancient standing stones and golden eagles. The island boasts stunning scenery Tobermory is famous for the brightly-painted houses along its main street, and stood in for the fictional town of Balamory in the hit children’s TV series. The jobs are advertised on the HiJOBS website - which has details and to apply for the Island Bakery Organics roles. Laura Saunders, Commercial Director and Founder, HiJOBS, said: \"This is one of the sweetest jobs HiJOBS has ever promoted. It's rare for a full-time, year-round role that includes accommodation to come up in remote locations such as the Hebrides, which is a real barrier in attracting new talent to the region.\" \"HiJOBS prides itself on supporting rural Scottish communities, and Island Bakery is the ideal example of a local and successful family-run business with the community at its heart.\"",
      "pubDate": "2023-06-10 13:02:34",
      "image_url": "https://www.heraldscotland.com/resources/images/16874377/?type=app&htype=0",
      "source_id": "heraldscotland",
      "category": [
        "business"
      ],
      "country": [
        "united kingdom"
      ],
      "language": "english"
    },
    {
      "title": "Newcastle-based Fat Hippo opens second London restaurant",
      "link": "https://www.thenorthernecho.co.uk/news/23609816.newcastle-based-fat-hippo-opens-second-london-restaurant/?ref=rss",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "A successful independent North East restaurant group is putting on a show in the heart of London’s theatre district with the launch of its first West End venue.",
      "content": "A successful independent North East restaurant group is putting on a show in the heart of London’s theatre district with the launch of its first West End venue. The Fat Hippo Group has opened the doors at a new 100-cover venue on Wardour Street in Soho as part of the latest stage of its continuing expansion plans. It’s the Newcastle-headquartered group’s second London location, sitting alongside its Shoreditch premises – and after opening five new burger restaurants during 2022, it is aiming to add a further three to its growing portfolio this year. Enjoy a full subscriber experience with The Echo A new restaurant on central Edinburgh’s iconic George Street is scheduled to open in the summer, with a further venue in Bath following before the end of the year. Around 90 new jobs will be created across the new locations this year, pushing the total number of people employed by the group towards the 600 mark, and several more restaurants will follow in 2024. Fat Hippo was founded in 2010 by managing director Michael Phillips, who opened the company's first restaurant in Jesmond after writing his original business plan while still a student at Northumbria University. Its Cardiff, Birmingham, Glasgow, York and Shoreditch restaurants all opened last year, and sit alongside venues in Newcastle, Durham, Leeds, Liverpool and Nottingham city centres. It also has four concession kiosks within premium bowling venue Lane 7’s Sheffield, Manchester, Bristol and Edinburgh premises, a further concession in the unique Kommune urban foodhall in Sheffield and a street food fleet that travels across the UK. Fat Hippo in Durham (Image: The Northern Echo) Fat Hippo offers a range of signature beef and chicken burgers, with a growing number of vegan options now making up a significant proportion of its offering. Michael Phillips says: \"Being in central London is an exciting step for the Fat Hippo brand, and the reception we’ve had has been everything we could have asked for. “There’s obviously a lot of competition in this part of the capital, but we’re confident that the quality of our menu, the breadth of options available to customers across a wide range of demographics and the competitive pricing strategy we offer will enable our Soho restaurant to compete and succeed. “After a very successful 2022, we’re now delivering the next phase of a growth strategy that will see us make another step change in our nationwide operations. “Our focus remains very much on controlled growth and we’re also very selective in terms of the cities and spaces we consider for our new restaurants, rather than simply opening anywhere and everywhere. “Taking our workforce towards 600 people by the end of the year is a big achievement for a business that started with a single small venue in North East England, but we know that there’s a lot more potential in the brand to be realised in 2024 and beyond.\" The Fat Hippo Group management team is continuing to work with Paul Gainford and Julie Cuthbertson of Gosforth-based RMT Accountants and Business Advisors on all aspects of its growth strategy, as well as the wider management of its expanding operations. Read more: Praise from Mayors as Boho X construction finishes at St Hilda’s My story - by Cummins Engine Business President Ex-NHS worker who starts at 5.30 with four kids opens a sandwich shop Michael said: \"RMT’s advice and guidance will be central to how we do this, and their strategic input remains invaluable to the development and execution of our growth plans.” Paul Gainford, director of commercial services at RMT Accountants, adds: \"Fat Hippo has become a successful national brand by staying true to its core concept, adapting to new market opportunities and securing high quality locations which fit with the character of the brand. “The progress that the business has made in recent challenging conditions is very impressive and we’re proud to be a long-term part of its continuing evolution.”",
      "pubDate": "2023-06-25 19:00:00",
      "image_url": "https://www.thenorthernecho.co.uk/resources/images/16922303/?type=app&htype=0",
      "source_id": "thenorthernecho",
      "category": [
        "business"
      ],
      "country": [
        "united kingdom"
      ],
      "language": "english"
    },
    {
      "title": "Musk vs Zuckerberg: Cage fight or not, an AI duel is in the offing",
      "link": "https://www.livemint.com/companies/news/meta-ceo-mark-zuckerberg-and-tesla-s-elon-musk-to-engage-in-cage-fight-over-ai-mindshare-dominance-in-new-delhi-11687717534074.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "The prospect of witnessing the two billionaires battling it out in a cage provided enough fodder for memes to netizens",
      "content": "New Delhi: When Meta CEO Mark Zuckerberg agreed to engage in a cage fight with Tesla chief executive Elon Musk there was an air of amusement rather than surprise. In fact, regardless of the outcome, or speculations over who is a stronger martial artist, the prospect of witnessing the two billionaires battling it out in a cage provided enough fodder for memes to netizens. Though Musk and Zuckerberg have been anything but friends, this brawn-over-brain battle was triggered by a podcast interview with Massachusetts Institute of Technology research scientist Lex Fridman on 9 June, where Zuckerberg said: “I’ve always thought that Twitter should have a billion people using it...\" One may recall that Musk’s Twitter deal concluded on 27 October 2022, accompanied by dramatic events, including the removal of chief executive Parag Agrawal, chief financial officer Ned Segal, and legal and policy head Vijaya Gadde. Musk justified the layoffs, citing losses of $4 million per day. However, while it prompted many to write-off Twitter under Musk, the microblogging site seems to have withstood the storm. That said, the fact remains that compared to Meta, which owns four of the most popular global social media platforms, WhatsApp, Facebook Messenger, Facebook, and Instagram, with combined monthly users of over 3.5 billion, Twitter has a mere 354 million users. And, the sarcasm in the Meta chief’s podcast statement was not lost on Musk, resulting in an online exchange of words that led to Zuckerberg accepting the challenge for a physical fight. The duel may or may not take place eventually, with Musk’s mother, Maye Musk, insisting on a verbal duel and not physical fight. Yet, a closer look will reveal that the war of words is not just about Twitter, and hence is far from over with both companies grappling for AI mindshare, which is not as apparent as the fight for online eyeballs. Note Musk and Sam Altman had founded OpenAI in 2015, before the Tesla boss left the company’s board in 2018. Now he is reportedly setting up a team to develop AI-powered chatbot BasedAI. Musk is wary of Microsoft’s investment in OpenAI whose generative AI bot ChatGPT took the netizens by storm with more than 100 million users within two months. Musk has also accused OpenAI of “pushing for profits\" instead of developing the technology for human good. In April, Musk was among a thousand people calling for a six-month window on training systems that are “more powerful than GPT-4\", arguing that such systems should be developed when the world believes it can contain the risks. Ironically, Musk recently founded a new AI firm X.AI Corp, which is incorporated in Nevada and lists Musk as sole director, with Jared Birchall, the director of Musk’s family office, as secretary. The state filing was made a few of months ago, but Musk is yet to make things public. One may argue that it’s hard to see synergies between the firms owned by Musk. SpaceX, for instance, builds spacecraft and rockets, Tesla designs and manufactures electric vehicle, battery energy storage systems from home to grid scale, solar panels and roof tiles, among others, and Twitter is a microblogging platform. However, on closer inspection it suggests that Musk is strategically aligning his companies, and with access to vast amounts of personal data from tweets is building an information powerhouse, slicing and dicing the data with the help of Neuralink, a firm co-founded by him, which develops brain-machine interfaces with high bandwidth to enable seamless interaction between computers and humans. By harnessing the power of intelligent data, an immense financial opportunities awaits Musk, offering a potential rationale behind the incorporation of X.AI. Zuckerberg is also far from passive. As Google focused on AI and Microsoft made strides with its investment in OpenAI, he laid his own path by launching Meta, taking a metaverse-first approach, and distancing it from its Facebook roots. Unfortunately, history was not kind to Zuckerberg, as by October, Meta had invested a staggering $10-15 billion in the metaverse, and the substantial cash burn in this endeavour left investors and shareholders less than pleased. Meta, it appears, is now striking a balance between the metaverse (which it hasn’t abandoned as many think) and AI. It has created an AI Sandbox to “act as our testing playground for early versions of new tools and features, including generative AI-powered ad tools\". Meta Advantage is its portfolio of automation products that use AI and machine learning to help optimize campaign results, personalize ads. It also announced Meta Lattice, a new AI-driven model to improve the performance of its ads on its networks. Further, while Meta had to shut down two of its AI chatbots called BlenderBot and Galactica, due to glitches, it has got credibility back by releasing a Large Language Model Meta AI (LLaMA) and publicly sharing the code for researchers to test it. Meta’s LLaMA claims it requires “far less computing power and resources to test new approaches, validate others’ work, and explore new use cases\". Further, Meta’s Chief AI Scientist Yann LeCun who is one of the so-called godfathers of modern AI and did not sign the call for a moratorium on GPT4-like models, has taken the battle for AI mindshare a step further by introducing a new model called the Image Joint Embedding Predictive Architecture, or I-JEPA, which Meta is touting as the first AI model that will bring us “a step closer to human-level intelligence in AI\". In a 13 June blog, LeCun explains that I-JEPA learns by creating an internal model of the outside world that compares abstract representations of images instead of comparing them at the level of individual pixels. The representations learned by I-JEPA can also be used for many different applications without the need for “extensive fine tuning\". LeCun cites the example of training a 632M parameter visual transformer model using 16 A100 graphic processing units (GPUs) in less than two days with only 12 labeled examples per class as compared to other methods that “typically take two to 10 times more GPU-hours and achieve worse error rates when trained with the same amount of data (https://arxiv.org/abs/2301.08243)\". Meta has open-sourced the training code. LeCun argues that generative architectures typically learn by removing or distorting portions of the input to the model – for example, erasing part of a photo or hiding some of the words in a text passage, following which they try to predict the corrupted or missing pixels or words. In the process, though, generative methods could make mistakes a human would never make because the former focus on irrelevant details instead of capturing “high-level predictable concepts\". In this context, LeCun cites the example of how difficult it is for generative models to generate human hands accurately (the models often add extra digits or make other glaring errors). The idea behind LeCun’s vision, as stated in his blog, is that that humans learn a lot about the world by simply observing it, which is “common sense background knowledge\". Meta hopes to extend the JEPA approach to other domains such as image-text paired data and video data, and thus improve on existing generative AI models. Even as Google and Microsoft are monitoring Meta’s AI moves, it will be interesting to see what Musk pulls out of his sleeves now.",
      "pubDate": "2023-06-25 18:25:33",
      "image_url": "https://www.livemint.com/lm-img/img/2023/06/25/1600x900/Facebook--now-Meta--founder-Mark-Zuckerberg--left-_1687717513865.jpg",
      "source_id": "livemint",
      "category": [
        "business"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "RIL tests waters in consumer finance",
      "link": "https://www.livemint.com/companies/news/ril-tests-waters-in-consumer-finance-11687716776892.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Consumer loans are on offer under Jio brand at select outlets",
      "content": ": Ltd (RIL) is testing a consumer durables financing programme under the Jio brand at select Reliance Digital outlets before a full-fledged launch of Jio Financial Services later this year, people aware of the development said. visited two stores in Mumbai and adjoining Thane and spoke to executives at four other stores about the availability of financing under what they called Jio Finance. According to the executives, customers would be offered the option of Jio Finance alongside schemes from other banks and non-bank lenders. Billionaire Mukesh Ambani’s RIL is seeking to challenge established financiers such as by launching Jio Financial Services, the venture resulting from the demerger of Reliance’s financial services business. In May, shareholders and creditors approved the spinoff of Reliance Strategic Investments Ltd, which will be renamed Jio Financial Services. Once demerged, Macquarie expects it to be the fifth-largest financial services company by net worth. According to the executives, the company is doing a pilot run of the financing scheme and plans to roll out the same in more stores. “Jio is offering (EMI) finance to customers for buying home appliances,\" said an executive at one of the stores, requesting anonymity. The executive said while existing financiers offer similar products at retail outlets, those purchasing in-house brands of Reliance would benefit more if they used Jio Finance. There are some teething issues as well. One of the executives said it is taking longer to approve finance-backed purchases of some customers, given that it’s a new service. An email sent to an RIL spokesperson remained unanswered till press time. Since the announcement in October last year, analysts have been cautioning that Jio’s entry could be disruptive to the non-bank financing industry. Ambani’s entry into telecom and streaming services with ultra-low-cost offerings has shaken the industries and forced rivals to adjust strategies to remain competitive in a price-sensitive market. “Since Reliance has deep pockets, Jio Financial’s offerings will be closely tracked by the industry. However, the financial sector is highly regulated, and it would not be easy to replicate pricing models the company has used in other sectors,\" a financial sector analyst said on condition of anonymity. Analysts at Jefferies pointed out that given the group’s strong presence in retail and telecom segments, alongside vendor partnerships, Jio Financial Services could start with consumer lending—especially electronics—and merchant financing. “All necessary approvals for the listing of shares of Jio Financial Services should be in place by September. It will commence lending activities immediately and proceed for regulatory approvals for , life, and general insurance and regulatory approvals are expected to take 12-18 months,\" analysts at Jefferies said in a note on 1 April. A section of large Indian lenders has turned aggressive in retail, especially the unsecured loan segment, with pre-approved offers and quicker turnaround led by buoyant consumer demand. A report from credit bureau TransUnion Cibil in April found a “marked increase in demand for credit cards and personal loans\", which it said indicated the growing adoption of consumption-led credit products. The anticipation surrounding the new venture has also piqued the interest of lenders. A senior private sector banker said the market is large enough to accommodate new players, but it will depend on the products Jio launches. The banker said that Jio Financial Services could look at offering finance for its devices, much like how telecom companies in the US bundle mobile handsets with other services.",
      "pubDate": "2023-06-25 18:17:49",
      "image_url": "https://www.livemint.com/lm-img/img/2023/06/25/1600x900/2-0-739808419-reliancejio3-0_1680327377932_1687717047588.JPG",
      "source_id": "livemint",
      "category": [
        "business"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Tata Play Binge’s expansion to hinge on non-DTH base",
      "link": "https://www.livemint.com/companies/news/tata-play-binge-s-expansion-to-hinge-on-non-dth-base-11687716859600.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "After testing the service with its DTH subscriber base for over two years, the company has now opened up the platform for all connected TV and smartphone users, with no prerequisite of needing a DTH subscription",
      "content": "New Delhi: India’s leading direct-to-home (DTH) company Tata Play (earlier Tata Sky) is looking to increasingly reach out to non-DTH subscribers as it plans to bring more services on board its OTT aggregator platform Binge. After testing the service with its DTH subscriber base for over two years, the company has now opened up the platform for all connected TV and smartphone users, with no prerequisite of needing a DTH subscription. The company, which offers subscriptions to 27 OTT apps, is in the process of integrating Apple TV+ for its customers over the next few weeks and is in conversation with Netflix and Amazon Prime Video to make their apps accessible to mobile users, too, through a single subscription plan. Currently, the two platforms are only available to Tata Play DTH consumers. “We understand that content aggregation has two parts to it—doing deals (with platforms) and making content discovery easier for users,\" Harit Nagpal, managing director and chief executive, Tata Play told Mint. “We’ve been doing the same on linear television where we had large competitors and same principles apply here. Over the past few months, we’ve removed all technical glitches and are ready to reach out to non-Tata Play customers who may not have had an existing relationship with us in another form.\" This will be promoted via a campaign on television and digital platforms, besides Tata Play’s physical stores in India. The Binge platform boasts national, regional and international apps across 13 languages including Disney+ Hotstar, ZEE5, SonyLIV, Jio Cinema, Hallmark, MX Player, Lionsgate Play, Aha, VROTT, Sun NXT, ReelDrama, Voot Kids, Chaupal, Namma Flix, Planet Marathi, manoramaMAX, Koode, Tarang Plus, Hungama Play, Eros Now, ShemarooMe, Curiosity Stream, EPIC ON, Travelxp, DocuBay and ShortsTV. Other than OTT content, the company is experimenting with gaming, having partnered with Gamezop, to provide its users access to 100 games on the platform. This means that the games will work within the Tata Play Binge app. Up to four viewers can simultaneously access the platform’s library using a single subscription. A number of emerging aggregator platforms provided respite to smaller, niche streaming services struggling to stay afloat in India’s cluttered online video market. Even though over-the-top video platforms have also been offered by telecom operators as a bundled service, the arrival of aggregators like Prime Video Channels, Tata Play and Airtel XStream Premium bode well for the reach and subscriber base of smaller firms that are trying to find their feet. “We’ve also introduced linear news channels on the service, in Hindi and regional languages. Other than customized recommendations, we’ve also worked on expanding to more devices,\" Nagpal said. The Binge offering is now available on Amazon Fire TV Stick, mobile devices, tablets, personal computers and TV sets. With over 70 OTT services catering to over 500 million consumers in India, accessibility, availability and affordability are becoming pain points for end users, resulting in less than 90 million paid subscriptions in total. Binge is aimed at solving this problem, said Nagpal. To be sure, he emphasised that the general market continues to see traction for catch-up television programming besides web originals. However, the scope for the TV market to grow is immense. “India is the only country in the world with less than 90% TV penetration. Only 60% of the country’s households own a TV and as the economy changes, there is a long runway ahead of us,\" Nagpal said. He added that as is common, DTH bases have been seeing spikes during events of consumer interest, be it elections or cricket tournaments. In April this year, Tata Play, a joint venture between the Tata Group and the Walt Disney Co., got approval from the markets regulator Securities and Exchange Board of India (Sebi) to raise funds through an initial public offering (IPO). It was the first company in India to use the confidential pre-filing of draft papers option in November last year. It has more than 18 months to file for an IPO from the date of Sebi’s approval.",
      "pubDate": "2023-06-25 18:14:19",
      "image_url": "https://www.livemint.com/lm-img/img/2023/06/25/1600x900/The-company-is-in-the-process-of-integrating-Apple_1687716853720.jpg",
      "source_id": "livemint",
      "category": [
        "business"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "New Mexico has telephone hotline for women seeking access to abortion clinics",
      "link": "https://www.washingtontimes.com/news/2023/jun/25/new-mexico-has-telephone-hotline-for-women-seeking/?utm_source=RSS_Feed&utm_medium=RSS",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "New Mexico Gov. Michelle Lujan Grisham says her administration has set up a new telephone hotline for women seeking access to abortion clinics plus transportation and other assistance.",
      "content": "Back Print By Associated Press - Sunday, June 25, 2023 SANTA FE, N.M. — New Mexico Gov. Michelle Lujan Grisham says her administration has set up a new telephone hotline for women seeking access to abortion clinics plus transportation and other assistance. The hotline is already live but is still being built out, according to Lujan Grisham. The number is (833) 767-3776. It will be staffed by registered nurses with the state Department of Health and paid for using existing resources. New Mexico has seen a surge in abortions, driven largely by residents from Texas and other states that have enacted abortion bans. New Mexico is currently one of the states that has legal access to abortions. According to state data, there were more than 11,000 reported abortions statewide last year compared with nearly 4,900 abortions reported in 2021. So far this year, there have been almost 5,300 abortions performed in New Mexico, which currently has 19 abortion providers. Six of those providers offer surgical abortions, with the rest providing medical abortions. The hotline will also include advice on other maternal health issues and could end up convincing more out-of-state providers to relocate to New Mexico, Lujan Grisham said. It has been one year since the U.S. Supreme Court overturned Roe v. Wade, the landmark decision that legalized abortion nationwide. Copyright © 2023 The Washington Times, LLC. Please read our comment policy before commenting. Click to Read More and View Comments Click to Hide",
      "pubDate": "2023-06-25 19:42:30",
      "image_url": "https://twt-thumbs.washtimes.com/media/image/2023/06/25/Congress_Abortion__11486--16b51_s1440x960.jpg?f72536d07237fdd262042ae8f5e6e6de3b865f3c",
      "source_id": "washingtontimes",
      "category": [
        "health",
        "technology",
        "entertainment",
        "environment"
      ],
      "country": [
        "united states of america"
      ],
      "language": "english"
    },
    {
      "title": "Sarah, Duchess of York, undergoes surgery following breast cancer diagnosis",
      "link": "https://www.washingtontimes.com/news/2023/jun/25/sarah-duchess-of-york-undergoes-surgery-following-/?utm_source=RSS_Feed&utm_medium=RSS",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Sarah, the Duchess of York, underwent surgery after being diagnosed with breast cancer, according to a spokesperson.",
      "content": "Back Print By Associated Press - Sunday, June 25, 2023 LONDON — Sarah, the Duchess of York, underwent surgery after being diagnosed with breast cancer, according to a spokesperson. The 63-year-old was diagnosed with early-stage breast cancer following a routine mammogram. The surgery was a success and Sarah’s prognosis is good, the duchess’s spokesperson said. She was released from King Edward VII’s Hospital in London on Sunday to recuperate at home in Windsor. Sarah, the former wife of Prince Andrew and the mother of Princess Beatrice and Princess Eugenie, spoke about the diagnosis on her new podcast, “Tea Talks with the Duchess and Sarah,” set to be released Monday. She recorded the segment before her operation. Once a favorite target of Britain’s tabloids, the former Sarah Ferguson has previously published her memoirs and authored a number of children’s books as well as a historical romance for adults. Copyright © 2023 The Washington Times, LLC. Please read our comment policy before commenting. Click to Read More and View Comments Click to Hide",
      "pubDate": "2023-06-25 19:37:05",
      "image_url": "https://twt-thumbs.washtimes.com/media/image/2023/06/25/Britain_Sarah_Ferguson_85917_s1440x950.jpg?c7583c32a6153cba891e2ef6b7c8cb25a568948e",
      "source_id": "washingtontimes",
      "category": [
        "health",
        "technology",
        "entertainment",
        "environment"
      ],
      "country": [
        "united states of america"
      ],
      "language": "english"
    },
    {
      "title": "NYC gets $25M for e-bike charging stations, seeking to prevent deadly battery fires",
      "link": "https://www.washingtontimes.com/news/2023/jun/25/nyc-gets-25m-for-e-bike-charging-stations-seeking-/?utm_source=RSS_Feed&utm_medium=RSS",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "After a series of fires involving faulty e-bike batteries including a recent blaze that claimed four lives, New York City officials announced Sunday that they are receiving a $25 million emergency grant from the federal government to fund scores of charging stations citywide.",
      "content": "Back Print By Associated Press - Sunday, June 25, 2023 NEW YORK — After a series of fires involving faulty e-bike batteries including a recent blaze that claimed four lives, New York City officials announced Sunday that they are receiving a $25 million emergency grant from the federal government to fund scores of charging stations citywide. Mayor Eric Adams hopes the stations will provide a safer way for delivery workers, who rely on e-bikes to efficiently do their jobs, to recharge lithium batteries used to power their bicycles. “This means that residents will no longer need to charge the e-bikes in their apartments - what we find to be extremely dangerous, particularly when you charge them overnight,” Adams said at a news conference Sunday. He was flanked by the state’s two U.S. senators who helped secure the funding from the US. Department of Transportation. The announcement comes after a lithium ion battery caught fire and engulfed an e-bike shop in Manhattan’s Chinatown. The fire and thick smoke spread to apartments above the shop, killing four people and injuring three others, including a responding firefighter. In the days since, New York City officials sought the public’s help in cracking down on unsafe e-bike shops and fire officials issued at least 10 citations to shops for improper handling of the batteries. City officials said they’d previously fined the shop for its e-bike charging practices, though inspectors reportedly did not check to see if the store was selling reconditioned batteries on a recent visit. Under new guidelines, fire officials will be directed to respond to complaints about e-bike batteries within 12 hours, rather than the previous policy of three days. New York City has seen over 100 fires and 13 deaths this year linked to e-bikes, more than double the total number of fatalities from last year, officials said. The city has issued nearly 500 summonses related to e-bikes, which can result in fines between $1,000 and $5,000. The batteries can overheat if defective or improperly charged. Adams had announced in March that the city was working to establish charging stations. The grant would fund an initial 170 charging units in about 50 locations. New York Sen. Chuck Schumer, the Senate Majority Leader, said the charging stations proved “new hope” to prevent “these fires that start from shoddy China-made lithium ion batteries and chargers,” he said during the press conference. Sen. Kirsten Gillibrand said she and Schumer were working on legislation to establish safety standards for batteries. “If passed,” she said, “it would take improperly manufactured batteries off the market.” Copyright © 2023 The Washington Times, LLC. Please read our comment policy before commenting. Click to Read More and View Comments Click to Hide",
      "pubDate": "2023-06-25 17:59:46",
      "image_url": "https://twt-thumbs.washtimes.com/media/image/2023/06/25/Ebike_NY_Grant_61787_s1440x960.jpg?f72536d07237fdd262042ae8f5e6e6de3b865f3c",
      "source_id": "washingtontimes",
      "category": [
        "health",
        "technology",
        "entertainment",
        "environment"
      ],
      "country": [
        "united states of america"
      ],
      "language": "english"
    },
    {
      "title": "Strange bedfellows: auto rivals embrace Tesla EV chargers",
      "link": "https://techxplore.com/news/2023-06-strange-bedfellows-auto-rivals-embrace.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Tesla's electric charging network has long pleased electric car mavens. But Elon Musk's \"superchargers\" are now winning endorsements from a more unlikely group: other auto companies.",
      "content": "June 25, 2023 This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked reputable news agency proofread by John BIERS Tesla's electric charging network has long pleased electric car mavens. But Elon Musk's \"superchargers\" are now winning endorsements from a more unlikely group: other auto companies. Ford was the first to announce a partnership with Musk in late May, followed by General Motors earlier this month. On Tuesday, EV truck company Rivian joined the bandwagon, saying it looks forward \"to continuing to find new ways to accelerate EV adoption.\" Under the partnerships, Musk has agreed to let consumers with autos from rival brands utilize its national network. Appearing with Musk on Twitter Spaces, GM Chief Executive Mary Barra said she was \"really excited\" to almost double the volume of chargers available to GM vehicle owners, adding that she hoped the Tesla system, known as the North American Charging Standard (NACS), could become a unified standard for the continent, which would \"enable more mass adoption.\" The ascendance of Tesla's network reflects the system's reputation for reliability, as well as the sluggish expansion of rival EV charging options amid supply chain problems and a ponderous rollout of a giant federal program. The embrace by Detroit auto giants has been seen as Musk's latest coup, helping to fuel a roughly 40-percent surge in Tesla shares since the May 25 Ford announcement. Still, many EV experts say it is premature to declare NACS the winner. \"We may be heading that way, but it's still too early to say Tesla and NACS has won,\" said industry consultant Loren McDonald, who thinks the market's short-run evolution could be akin to the smartphone split between Apple and Android, with two leading standards. EV experts note that other automakers with ambitious US electric vehicle programs, such as Volkswagen and Hyundai, continue to favor the rival standard, known as the combined charging system (CCS). \"Ultimately we'll have one standard, but how long that takes remains to be seen,\" said John Eichberger, executive director of the Transportation Energy Institute. Eichberger said a Musk-dominated charging system could raise antitrust concerns, adding that it is not yet clear how far the Tesla CEO will go in sharing a technology that had until recently been proprietary. \"If we are going to gravitate towards one default source for charging, then it needs to be an open-source technology,\" Eichberger said. Until recently, many in the industry assumed CCS was in line to become the national standard, in part because it is explicitly required as the connector to be used in a new federal program. The initiative, the National Electric Vehicle Infrastructure (NEVI) program, which was established in the 2021 infrastructure bill signed into law by President Joe Biden, provides $5 billion in funds for states to build EV charging networks. In February, the White House unveiled an agreement with Musk in which Tesla agreed to make at least 7,500 chargers nationwide open to non-Tesla EVs by the end of 2024, a move that allows Tesla to potentially qualify for NEVI funds. There has been no indication that the White House will shift its policy, but states are reconsidering their implementation in light of recent industry developments. Texas plans to require each charge port to have a CCS connector and a NACS connector, a Texas Department of Transportation spokesman told AFP on Friday. Tesla's shift comes amid concerns there won't be enough chargers. A January 2023 forecast by S&P Global concluded that the US charging system is \"not nearly robust enough to support a maturing electric vehicle market,\" saying that the number of EV chargers in the country would need to quadruple between 2022 and 2025. The number of EV chargers \"has been increasing, but very slowly compared to the number of vehicles coming into the market,\" said Bertrand Rakoto, global automotive practice leader at Ducker Carlisle, a consultancy. Industry experts have cited a number of reasons for the sluggish pace of the rollout, including supply chain shortages of key materials; challenges in negotiating affordable electricity contracts with utilities; and delays with NEVI because of uncertainty about federal guidelines or difficulties in states that have no experience in permitting EV chargers. A Department of Energy spokesperson said the agency has been \"working hard to stand up\" the program and listed seven jurisdictions that have released requests for proposals. But McDonald, who closely tracks state NEVI programs, said no states have awarded contracts to build EV chargers so far. He does not expect most of the chargers to be built until 2025 or later. Much industry focus has been on the need to build fast chargers to address range anxiety: the fear of drivers being stranded without access to charging capacity. But McDonald believes this concern is overrated, viewing the real priority as adding chargers at homes, apartment buildings and condos. © 2023 AFP",
      "pubDate": "2023-06-25 17:41:28",
      "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2023/the-embrace-of-teslas.jpg",
      "source_id": "phys",
      "category": [
        "technology"
      ],
      "country": [
        "australia",
        "united kingdom",
        "india",
        "singapore",
        "united states of america"
      ],
      "language": "english"
    }
  ],
  "nextPage": "1686399300afac7f1cfed86a6d48eadb1d14b363b5"
}